-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 27 2019 г., 03:09
-- Версия сервера: 8.0.15
-- Версия PHP: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `mysite`
--

-- --------------------------------------------------------

--
-- Структура таблицы `country`
--

CREATE TABLE `country` (
  `code` char(2) NOT NULL,
  `name` char(52) NOT NULL,
  `population` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `country`
--

INSERT INTO `country` (`code`, `name`, `population`) VALUES
('AU', 'Australia', 24016400),
('BR', 'Brazil', 205722000),
('CA', 'Canada', 35985751),
('CN', 'China', 1375210000),
('DE', 'Germany', 81459000),
('FR', 'France', 64513242),
('GB', 'United Kingdom', 65097000),
('IN', 'India', 1285400000),
('RU', 'Russia', 146519759),
('US', 'United States', 322976000);

-- --------------------------------------------------------

--
-- Структура таблицы `drons`
--

CREATE TABLE `drons` (
  `id` int(11) NOT NULL,
  `model` varchar(65) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `drons`
--

INSERT INTO `drons` (`id`, `model`) VALUES
(1, 'DJI Mavic Pro'),
(2, 'DJI Mavic2 Pro');

-- --------------------------------------------------------

--
-- Структура таблицы `find_drons`
--

CREATE TABLE `find_drons` (
  `id` int(11) NOT NULL,
  `name` varchar(30) NOT NULL,
  `surname` varchar(30) NOT NULL,
  `thirdname` varchar(30) NOT NULL,
  `drone_id` int(11) NOT NULL,
  `drone_reg_number` varchar(7) NOT NULL,
  `date` date NOT NULL,
  `x_coords` varchar(30) NOT NULL,
  `y_coords` varchar(30) NOT NULL,
  `created_at` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `find_drons`
--

INSERT INTO `find_drons` (`id`, `name`, `surname`, `thirdname`, `drone_id`, `drone_reg_number`, `date`, `x_coords`, `y_coords`, `created_at`) VALUES
(1, 'Александр', 'Новиков', 'нет', 1, '000x000', '2019-12-20', '43.14556418293157', '131.98195727734378', '1576938752'),
(3, 'Александр', 'Новиков', 'нет', 2, '321123', '2026-12-20', '43.18376395109808', '132.03963550000003', '1576935729'),
(4, 'Александр', 'Новиков', 'нет', 2, '3231321', '2026-12-20', '0', '0', '1576937508'),
(5, 'Имя', 'Фамилия', 'нет', 2, '000с000', '2012-12-20', '43.15360823860474', '132.02590258984375', '1576941628'),
(6, 'Bvz', 'wertyui', 'ertyui', 2, '000x032', '2025-12-20', '0', '0', '1576944763'),
(7, 'Александр', 'Новиков', 'нет', 1, '000x012', '2011-12-20', '43.23399014991086', '132.050621828125', '1576944736'),
(8, 'Александр', 'Новиков', 'нет', 1, '13321', '2019-12-20', '43.13751906103867', '132.02040942578125', '1576944682'),
(9, 'Александр', 'Новиков', 'нет', 2, '080x032', '2017-12-20', '43.09727745882204', '131.9023063984375', '1576944784'),
(10, 'Александр', 'Новиков', 'нет', 1, '009x000', '2019-12-20', '43.14254738716852', '131.95998462109375', '1576944975'),
(11, 'Александр', 'Новиков', 'нет', 2, '770x000', '2011-12-20', '43.169693151230426', '132.01491626171875', '1576945261'),
(12, 'Александр', 'Новиков', 'нет', 2, '100x032', '2011-12-20', '0', '0', '1577129978'),
(13, 'Александр', 'Новиков', 'нет', 1, '123231', '2012-12-20', '63.728334805600234', '124.17114877490228', '1577395090'),
(14, 'Александр', 'Новиков', 'нет', 2, '224312', '2019-12-20', '63.72650876834927', '124.19724130419915', '1577394656'),
(15, 'Александр', 'Новиков', 'нет', 1, '212321', '2005-12-20', '63.74506797327476', '124.19106149462883', '1577395072'),
(16, 'Александр', 'Новиков', 'нет', 1, '75557', '2021-12-20', '63.72042112375915', '124.12857675341792', '1577395114'),
(17, 'Александр', 'Новиков', 'нет', 2, '12', '2025-12-20', '63.73198652550303', '124.15535592822259', '1577395233'),
(18, 'Александр', 'Новиков', 'нет', 2, '700x032', '2011-12-20', '63.73229081415443', '124.1622223833007', '1577395306'),
(19, 'Александр', 'Новиков', 'нет', 1, '132213', '2014-12-20', '63.735637772646086', '124.13200998095695', '1577395424'),
(20, 'Александр', 'Новиков', 'нет', 2, '040x000', '2026-12-20', '0', '0', '1577395442'),
(21, 'Александр', 'Новиков', 'нет', 1, '121211', '2004-12-20', '63.733812208166604', '124.1951813676757', '1577395544'),
(22, 'Александр', 'Новиков', 'нет', 2, '133211', '2019-12-20', '63.74658867798505', '124.15535592822259', '1577395693'),
(23, 'Александр', 'Новиков', 'нет', 1, '132132', '2027-11-20', '63.73137793835104', '124.1718354204101', '1577395897'),
(24, 'Александр', 'Новиков', 'нет', 1, '1223321', '2013-12-20', '63.749325739715374', '124.1951813676757', '1577396329'),
(25, 'Александр', 'Новиков', 'нет', 2, '132312', '2029-11-20', '63.72955209809957', '124.23981332568351', '1577396457'),
(26, 'Александр', 'Новиков', 'нет', 2, '228x032', '2028-12-20', '63.74476382248714', '124.20548105029289', '1577396545'),
(27, 'Александр', 'Новиков', 'нет', 2, '120x032', '2019-12-20', '63.7444596684176', '124.15741586474604', '1577397171'),
(28, 'Александр', 'Новиков', 'нет', 1, '98789', '2011-12-20', '63.72468261289086', '124.14299630908198', '1577397241'),
(29, 'Александр', 'Новиков', 'нет', 1, '31231', '2028-12-20', '63.739136440912205', '124.14642953662101', '1577397283'),
(30, 'Александр', 'Новиков', 'нет', 2, '000x132', '2013-12-20', '63.736246267877135', '124.17114877490228', '1577397529'),
(31, 'Александр', 'Новиков', 'нет', 1, '123', '2027-12-20', '63.735637772646086', '124.17526864794914', '1577397741'),
(32, 'Александр', 'Новиков', 'нет', 2, '0000', '2026-12-20', '63.735637772646086', '124.1773285844726', '1577397817'),
(33, 'Александр', 'Новиков', 'нет', 1, '080x031', '2014-12-20', '63.73107363985038', '124.20754098681635', '1577397854'),
(34, 'Александр', 'Новиков', 'нет', 1, '000x228', '2025-12-20', '63.73837589778296', '124.15329599169918', '1577397986'),
(35, 'Александр', 'Новиков', 'нет', 2, '002x032', '2013-12-20', '63.72650876834927', '124.16153573779292', '1577398207'),
(36, 'Александр', 'Новиков', 'нет', 1, '540x032', '2019-12-20', '63.741265852535065', '124.20822763232414', '1577398287'),
(37, 'Александр', 'Новиков', 'нет', 2, '4432', '2026-12-20', '63.73898433392759', '124.18282174853509', '1577398349'),
(38, 'Александр', 'Новиков', 'нет', 2, '32123', '2018-12-20', '63.72224755505782', '124.17114877490228', '1577398450'),
(39, 'Александр', 'Новиков', 'нет', 1, '550x012', '2014-12-20', '63.72803047426699', '124.21166085986322', '1577398561'),
(40, 'Александр', 'Новиков', 'нет', 1, '600x032', '2026-12-20', '63.72346511024484', '124.1951813676757', '1577398637'),
(41, 'Александр', 'Новиков', 'нет', 2, '400x012', '2025-12-20', '63.74324301931978', '124.212347505371', '1577398715');

-- --------------------------------------------------------

--
-- Структура таблицы `lost_drons`
--

CREATE TABLE `lost_drons` (
  `id` int(11) NOT NULL,
  `name` varchar(30) NOT NULL,
  `surname` varchar(30) NOT NULL,
  `thirdname` varchar(30) NOT NULL,
  `drone_id` int(11) NOT NULL,
  `drone_reg_number` varchar(7) NOT NULL,
  `date` date NOT NULL,
  `x_coords` varchar(30) NOT NULL,
  `y_coords` varchar(30) NOT NULL,
  `created_at` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `lost_drons`
--

INSERT INTO `lost_drons` (`id`, `name`, `surname`, `thirdname`, `drone_id`, `drone_reg_number`, `date`, `x_coords`, `y_coords`, `created_at`) VALUES
(1, 'Александр', 'Новиков', 'нет', 2, '5887', '2013-12-20', '43.17371371297558', '131.94625171093753', '1576941303'),
(2, 'Александр', 'Новиков', 'нет', 1, 'qewqee', '2021-12-20', '43.175723893885184', '132.01491626171875', '1576941336');

-- --------------------------------------------------------

--
-- Структура таблицы `pairs`
--

CREATE TABLE `pairs` (
  `id` int(11) NOT NULL,
  `fid` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `lid` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `match_rate` varchar(7) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `pairs`
--

INSERT INTO `pairs` (`id`, `fid`, `lid`, `match_rate`) VALUES
(105, '12', '1', ' 0.00'),
(106, '12', '2', ' 0.00'),
(107, '12', '1', '57.14'),
(108, '12', '3', '46.15'),
(109, '12', '4', '42.86'),
(110, '12', '5', '42.86'),
(111, '12', '6', '85.71'),
(112, '12', '7', '85.71'),
(113, '12', '8', '50.00'),
(114, '12', '9', '85.71'),
(115, '12', '10', '57.14'),
(116, '12', '11', '57.14'),
(117, '12', '12', '100.00'),
(118, '12', '13', '46.15'),
(119, '12', '14', '46.15'),
(120, '12', '15', '46.15'),
(121, '12', '16', ' 0.00'),
(122, '12', '17', '44.44'),
(123, '12', '18', '85.71'),
(124, '12', '19', '46.15'),
(125, '12', '20', '57.14'),
(126, '12', '21', '30.77'),
(127, '12', '22', '46.15'),
(128, '12', '23', '46.15'),
(129, '12', '24', '42.86'),
(130, '12', '25', '46.15'),
(131, '12', '26', '57.14'),
(132, '12', '27', '85.71'),
(133, '12', '28', ' 0.00'),
(134, '12', '29', '50.00'),
(135, '12', '30', '100.00'),
(136, '12', '31', '60.00'),
(137, '12', '32', '54.55'),
(138, '12', '33', '85.71'),
(139, '12', '34', '71.43'),
(140, '12', '35', '85.71'),
(141, '12', '36', '71.43'),
(142, '12', '37', '36.36'),
(143, '12', '38', '50.00'),
(144, '12', '39', '71.43'),
(145, '12', '40', '85.71'),
(146, '12', '41', '85.71');

-- --------------------------------------------------------

--
-- Структура таблицы `phones`
--

CREATE TABLE `phones` (
  `id` int(15) NOT NULL,
  `uid` int(15) NOT NULL,
  `phone` varchar(15) NOT NULL,
  `varification_code` int(4) NOT NULL,
  `created_at` int(11) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `phones`
--

INSERT INTO `phones` (`id`, `uid`, `phone`, `varification_code`, `created_at`, `status`) VALUES
(16, 41, '23we12', 0, 1576922990, 1),
(19, 0, '1322311', 4767, 1576927962, 0),
(20, 3, '89245004713', 0, 1576937142, 1),
(21, 0, '1322311312', 1773, 1576936113, 0),
(22, 1, '2132131231', 0, 1576938630, 1),
(23, 0, '123456', 4427, 1576940319, 0),
(24, 1, '54321', 0, 1576940442, 1),
(25, 2, '1234565', 0, 1576941313, 1),
(26, 5, '123456789', 0, 1576941586, 1),
(27, 6, '132123', 0, 1576944324, 1),
(28, 12, '895554', 0, 1577129953, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `queue`
--

CREATE TABLE `queue` (
  `id` int(11) NOT NULL,
  `channel` varchar(255) NOT NULL,
  `job` blob NOT NULL,
  `pushed_at` int(11) NOT NULL,
  `ttr` int(11) NOT NULL,
  `delay` int(11) NOT NULL DEFAULT '0',
  `priority` int(11) UNSIGNED NOT NULL DEFAULT '1024',
  `reserved_at` int(11) DEFAULT NULL,
  `attempt` int(11) DEFAULT NULL,
  `done_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `country`
--
ALTER TABLE `country`
  ADD PRIMARY KEY (`code`);

--
-- Индексы таблицы `drons`
--
ALTER TABLE `drons`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `find_drons`
--
ALTER TABLE `find_drons`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `lost_drons`
--
ALTER TABLE `lost_drons`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `pairs`
--
ALTER TABLE `pairs`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `phones`
--
ALTER TABLE `phones`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `queue`
--
ALTER TABLE `queue`
  ADD PRIMARY KEY (`id`),
  ADD KEY `channel` (`channel`),
  ADD KEY `reserved_at` (`reserved_at`),
  ADD KEY `priority` (`priority`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `drons`
--
ALTER TABLE `drons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `find_drons`
--
ALTER TABLE `find_drons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT для таблицы `lost_drons`
--
ALTER TABLE `lost_drons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `pairs`
--
ALTER TABLE `pairs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=147;

--
-- AUTO_INCREMENT для таблицы `phones`
--
ALTER TABLE `phones`
  MODIFY `id` int(15) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT для таблицы `queue`
--
ALTER TABLE `queue`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
